import os,shutil

mps=[
    'ゲームを終了します','结束游戏','結束游戲',
    'ゲームシステムの設定を行います','打开游戏系统设置','打開遊戲系統設置',
    '音楽鑑賞画面へ移行します','打开音乐鉴赏界面','打開音樂鑑賞界面',
    'ギャラリー画面へ移行します','Gallery界面','Gallery界面',
    'セーブした場面から再開します','从保存的场景重新开始','從保存的場景重新開始',
    '最初から始めます','从最初开始','從最初開始',
    #func_lib
    'クイックセーブを実行しました','快速存档完毕','快速存檔完畢'  ,
    r'''ゲームを終了します。
よろしいですか？''',
    '确定要结束游戏吗？','確定要結束遊戲嗎？',
    r'''タイトルに戻ります。
よろしいですか？''',
    '确定要返回到标题界面吗？','確定要返回到標題界面嗎？',
    r'''前の選択肢に戻ります。
よろしいですか？''',
    '确定要返回到前一个选择支吗？','確定要返回到前一個選擇支嗎？',
    'テキスト履歴を閉じる','关闭历史文本记录','關閉歷史文本記錄',
    '実行に必要なDLLがロードされていません','无法加载游戏运行所需的DLL插件','無法載入遊戲運行所需的DLL插件',
    '不正なバイナリデータを読み込みました','二进制数据读取错误','二進位數據讀取錯誤',
    r'''『俺たちに翼はない』のディスクを
DVDドライブに入れて下さい。''',r'''请将『我们没有翅膀』的光盘
插入至DVD读取器中。''',r'''請將『我們沒有翅膀』的光碟
插入至DVD讀取器中。''',
r'''描画カーネルがGdiSpriteを使用できない可能性があります。
環境設定を見直して下さい。''',r'''描线内核可能无法正常使用GdiSprite。
请重新调整游戏环境设定。''',r'''描線內核可能無法正常使用GdiSprite。
請重新調整遊戲環境設定。''',
r'''選択されたキャラクタごとに音量を設定できます。
チェックマークの付いていないキャラクタの音声
は再生されません。''',r'''通过选择特定角色，改变语音量大小。
未带识别按钮的角色
无法进行语音再生操作。''',r'''通過選擇特定角色，改變語音量大小。
未帶識別按鈕的角色
無法進行語音再生操作。''',
'｢サウンド・フレーム設定｣を初期設定に戻します','「语音·框架设定」恢复初始状态','「語音·框架設定」恢復初始狀態',
r'''選択されたフォントでテキスト描画を行います。
フォント名が正常に表示されないフォントは
ゲームに支障の出る恐れがあります。''',
r'''以选择的字体来显示文本。
字体名无法正常显示的字体
可能会对游戏运行造成影响。''',
r'''以選擇的字體來顯示文字。
字體名無法正常顯示的字體
可能會對遊戲運行造成影響。''',
'｢システム・テキスト設定｣を初期設定に戻します','「系统·文本设定」恢复初始状态','「系統·文字設定」恢復初始狀態',

]
cnt={}
for current in ['CHS','CHT']:
    shutil.copy('SCRIPT.LPK/func_lib.sob',current+ '\\SCRIPT.LPK_pack\\func_lib.sob')
    for f in ['title.sob','title2.sob','func_lib.sob','history.sob','history.sob','gameinit.sob','config2.sob','config1.sob']:

        try:
            with open(current+ '\\SCRIPT.LPK_pack\\'+f,'rb') as ff:
                bs=ff.read()
        except:
            continue
        
        bs=bytearray(bs)
        for i in range(len(mps)):
            if i%3!=0:continue
            sjis=mps[i].encode('cp932')
            gbk=mps[i+(1 if(current=='CHS') else 2)].encode('gbk')
            
            idx=bs.find(b'\x00'+sjis+b'\x00')
            if idx<0:continue
            if mps[i] not in cnt:
                cnt[mps[i]]=0
            cnt[mps[i]]+=1
            idx+=1
            for j in range(len(sjis)):
                bs[idx+j]=0
            for j in range(len(gbk)):
                bs[idx+j]=gbk[j]

        with open(r'C:\dataH\俺たちに翼はない\SCRIPT_'+current+'\\'+f,'wb') as ff:
            ff.write(bs)
    print(cnt)